geometricVof/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          222;
        startFace       13959;
    }
    symm
    {
        type            symmetry;
        nFaces          288;
        startFace       14181;
    }
    outlet
    {
        type            patch;
        nFaces          222;
        startFace       14469;
    }
    side
    {
        type            patch;
        nFaces          444;
        startFace       14691;
    }
    defaultFaces
    {
        type            patch;
        nFaces          522;
        startFace       15135;
    }
)

// ************************************************************************* //
