geometricVof/system/setVofFieldDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          setVofFieldDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

field               "alpha.oil";
initial             0.0;
snapTol             1e-12;

triangulationScheme "centroid";
extraBooleanCheck   false;

exportPlicSurface   false;
exportIsoSurface    false;
writeShapes         false;

shapes
{
    box1
    {
        type        box;
        min         (-0.11 -0.08  -0.01);
        max         ( 0.11  0.08   0.04);
        mode        add;
    }

//    cylinder1
//    {
//        type        cylinder;
//        point1      (-0.06 0.04 0.12);
//        point2      (-0.06 0.04 0.16);
//        radius      0.011;
//        vertices    32;
//        mode        add;
//    }
}


// ************************************************************************* //
